<?php

return [
    /*
    |--------------------------------------------------------------------------
    | 积分计算器路由
    |--------------------------------------------------------------------------
    |
    */
    'count' => [
        # 路由前缀
        'prefix' => env('COUNT_ROUTE_PREFIX', ''),
        # 路由URL
        'route' => env('COUNT_ROUTE', 'evaluate'),
        # 转发URL
        'url' => env('COUNT_URL', '')
    ],

    /*
    |--------------------------------------------------------------------------
    | 落户自测路由
    |--------------------------------------------------------------------------
    |
    */
    'evaluate' => [
        # 路由前缀
        'prefix' => env('EVALUATE_ROUTE_PREFIX', ''),
        # 路由URL
        'route' => env('EVALUATE_ROUTE', 'evaluate'),
        # 转发URL
        'url' => env('EVALUATE_URL', '')
    ]
];
