<?php

return [


    /*
    |--------------------------------------------------------------------------
    | 积分计算器路由
    |--------------------------------------------------------------------------
    |
    */
    'data_system_url' => env('DATA_SYSTEM_URL', ''),

    /*
    |--------------------------------------------------------------------------
    | 积分计算器路由
    |--------------------------------------------------------------------------
    |
    */
    'count' => [
        # 路由前缀
        'prefix' => env('COUNT_ROUTE_PREFIX', ''),
        # 路由URL
        'route' => env('COUNT_ROUTE', 'evaluate'),
        # 转发URL
        'url' => env('COUNT_URL', '')
    ],

    /*
    |--------------------------------------------------------------------------
    | 落户自测路由
    |--------------------------------------------------------------------------
    |
    */
    'evaluate' => [
        # 路由前缀
        'prefix' => env('EVALUATE_ROUTE_PREFIX', ''),
        # 路由URL
        'route' => env('EVALUATE_ROUTE', 'evaluate'),
        # 转发URL
        'url' => env('EVALUATE_URL', env('COUNT_URL'))
    ],

    /*
    |--------------------------------------------------------------------------
    | 个税社保计算器
    |--------------------------------------------------------------------------
    |
    */
    'calc' => [
        # 路由前缀
        'prefix' => env('CALC_ROUTE_PREFIX', ''),
        # 路由URL
        'route' => env('CALC_ROUTE', 'calc'),
        # 转发URL
        'url' => env('CALC_URL', env('COUNT_URL'))
    ]
];
